# Analyzing CIA Factbook Data Using SQL

## Introduction

### Preliminary

This Notebook is the conclusion of the ***SQL Fundamentals Course*** from [dataquest.io](dataquest.io). It is a guided project whose aim is to use all the techniques and skills learnt during the course. Nevertheless we are dealing with real-word data: in our casewith data from the CIA World Factbook, a compendium of statistics about all of the countries on Earth. The Factbook contains demographic information like the following: `population` ,   `population_growth`, `area`.  
The SQLite factbook.db can be found  [here](https://dsserver-prod-resources-1.s3.amazonaws.com/257/factbook.db).
> I am sometimes using blockquotes as this one, meaning that for the rest of the project I am quoting some elements given by dataquest. For the sake of simplicity and clarity, I estimated that they did not need any reformulation and were immediately usable and convenient for me and the reader.

### Connecting to the database

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

## Overview of the Data

In [2]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [3]:
%%sql
SELECT *
  FROM facts
  LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

>Here are the descriptions for some of the columns:

>- name — the name of the country.
- area— the country's total area (both land and water).
- area_land — the country's land area in square kilometers.
- area_water — the country's waterarea in square kilometers.
- population — the country's population.
- population_growth— the country's population growth as a percentage.
- birth_rate — the country's birth rate, or the number of births per year per 1,000 people.
- death_rate — the country's death rate, or the number of death per year per 1,000 people.

## Summary Statistics

In [4]:
%%sql
SELECT MIN(population) min_pop, MAX(population) max_pop, MIN(population_growth) min_growth,MAX(population_growth) max_growth
    FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

#### Getting the less populated countries in the World

In [5]:
%%sql

SELECT name, population 
  FROM facts
 WHERE population != 'None'
 ORDER BY population ASC
LIMIT 5

 * sqlite:///factbook.db
Done.

[('Antarctica', 0),
 ('Pitcairn Islands', 48),
 ('Cocos (Keeling) Islands', 596),
 ('Holy See (Vatican City)', 842),
 ('Niue', 1190)]

#### Getting the most populated countries in the World

In [6]:
%%sql

SELECT name, population 
  FROM facts
 WHERE population != 'None'
 ORDER BY population DESC
LIMIT 5

 * sqlite:///factbook.db
Done.

[('World', 7256490011),
 ('China', 1367485388),
 ('India', 1251695584),
 ('European Union', 513949445),
 ('United States', 321368864)]

#### Exlcuding the row 'World'

In [7]:
%%sql
SELECT MIN(population) min_pop, MAX(population) max_pop, MIN(population_growth) min_growth,MAX(population_growth) max_growth
    FROM facts
    WHERE name !='World'

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

#### Exploring Average Population and Area

In [8]:
%%sql
SELECT AVG(population) avg_pop, AVG(area) avg_area
FROM facts
WHERE name !='World'

 * sqlite:///factbook.db
Done.

[(32242666.56846473, 555093.546184739)]

#### Finding Densely Populated Countries

In [9]:
%%sql
SELECT name, population, area
  FROM facts
 WHERE population > (SELECT AVG(population) from facts WHERE name !='World' ) 
       and area < (select AVG(area) from facts WHERE name !='World')

 * sqlite:///factbook.db
Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Iraq', 37056169, 438317),
 ('Italy', 61855120, 301340),
 ('Japan', 126919659, 377915),
 ('Korea, South', 49115196, 99720),
 ('Morocco', 33322699, 446550),
 ('Philippines', 100998376, 300000),
 ('Poland', 38562189, 312685),
 ('Spain', 48146134, 505370),
 ('Thailand', 67976405, 513120),
 ('Uganda', 37101745, 241038),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]